{
    "help":{
        "gender":"What is your sex?",
        "customer_type":"Are you a Loyal Customer?",
        "travel_type":"Are you in this flight for business or personal reasons?",
        "travel_class":"What flight class are you in?",
        "age":"Insert your age!",
        "distance":"Insert the distance of your flight (in km)",
        "wifi":"This input measures how satisfied you are with our inflight wifi service. Choose 0 if there was no inflight wifi service, pick between 1 and 5 to rate the internet speed (from bad to very good)",
        "dep_arr":"This input measures how satisfied you are with our departure/arrival time. Choose between 0 and 5 to rate the departure/arrival time (from very late to on time)",
        "booking":"This input measures how satisfied you are with our online booking feature. Choose 0 if there was no online booking service/You didn't book online, pick from 1 to 5 to rate your satisfaction when booking online",
        "gate":"This input measures how satisfied you are with our gate location. Choose between 0 and 5 to rate our gate location (from very unsatisfactory to very satisfied)",
        "fnb":"This input measures how satisfied you are with our food and drinks. Choose 0 if we didn't provide any food/beverages, pick between 1 and 5 to rate our food/drinks (from tasteless to delicious according to flight standards)",
        "online_boarding":"This input measures how satisfied you are with the online boarding process.Choose 0 if there was no online boarding service/You didn't use online boarding, pick from 1 to 5 to rate your satisfaction when boarding online",
        "seat":"This input measures how satisfied you are with our seats. Choose between 0 and 5 to rate our seats (from very uncomfortable to very comfortable)",
        "entertainment":"This input measures how satisfied you are with our inflight entertainment (movies, tv-series, music, games, toys, magazines, etc.). Choose 0 if we didn't provide any entertainment, pick between 1 and 5 to rate our inflight entertainment (from boring to fun)",
        "onboard_service":"This input measures how satisfied you are with our on-board services (when boarding the airplane). Choose between 0 and 5 to rate our on-board services (from very unsatisfied to very satisfied)",
        "leg":"This input measures how satisfied you are with our leg room service. Leg room is the amount of space available for your legs when you are sitting behind another seat. Choose between 0 and 5 to rate our leg room services (from very unsatisfactory to very satisfied)",
        "baggage":"This input measures how satisfied you are with our baggage handling. Rate us from 0 to 5 (from \"my things broke\" to \"they are all in perfect condition\")",
        "check_in":"This input measures how satisfied you are with the check in process. Choose between 0 and 5 to rate the check in process!",
        "service":"This input measures how satisfied you are with our inflight services (during the flight). Rate our inflight services from 0 to 5",
        "clean":"This input measures how satisfied you are of our cleanliness. Choose between 0 and 5 to rate the cleanliness (from dirty to spotless)",
        "dep_delay":"Insert the amount of minutes of delay during your departure",
        "arr_delay":"Insert the amount of minutes of delay during your arrival"    
    },
    "case":{
        "customer_type":{
            "Loyal Customer":"Loyal Customer",
            "Disloyal Customer":"disloyal Customer"
        },
        "travel_type":{
            "Business Travel":"Business travel",
            "Personal Travel":"Personal Travel"
        }
    },
    "problem":"Airplanes have always been the most favored choice in traveling abroad due to their safety and speed. However, the <a href='https://www.who.int/news-room/questions-and-answers/item/coronavirus-disease-covid-19-how-is-it-transmitted' target='_blank' style='text-decoration:none;'>COVID-19 pandemic</a> that's been going on for the last two years has caused a break in ticket sales for almost all airlines, making the airline business sector suffer heavy losses. With the pandemic starting to fade, the number of passengers has <a href='https://www.iata.org/en/pressroom/2022-releases/2022-03-01-01/' target='_blank' style='text-decoration:none;'>recovered substantially</a>, and living standards have also improved. As the living standards went up, airline companies should also improve their services. This translates to a need for a decision-supporting system capable of analyzing passenger satisfaction. This project uses data from <a href='https://www.kaggle.com/datasets/teejmahal20/airline-passenger-satisfaction' target='_blank' style='text-decoration:none;'>airline passenger satisfaction survey</a> to predict whether a passenger is satisfied with their flight. We divided the model design process into 2 phases: <a href='https://colab.research.google.com/drive/1ozDpPvwTh44hDEafooDxac9SjwNuupHl?usp=sharing' target='_blank' style='text-decoration:none;'> Data Analysis </a> and <a href='https://colab.research.google.com/drive/1Z2fyWWOsGw1KpCCJN4htMguOG4dEYOzV?usp=sharing' target='_blank' style='text-decoration:none;'>Modelling</a>.",
    "satisfaction": {
        "0":"Not applicable",
        "1":"Very unsatisfied",
        "2":"Unsatisfied",
        "3":"Normal",
        "4":"Satisfied",
        "5":"Very satisfied"
    }
}